

# 关于日期、期限
# 无效宣告请求的举证期，自提出请求日起1个月内
# 提无效的缴费期，自提出请求日起1个月内
# 答复复审通知书的期限是1个月
# 复审请求人提出复审请求的期限，收到驳回决定之日起3个月(缴费期同)
# 权利恢复期一般是2个月
# 行政复议的期限是60日(3个月)
# 答复第一次审查意见通知书的期限是4个月
# 参加口审的每方当事人及其代理人的数量不得超过4人
# 侵犯专利权的诉讼时效为2年，自得知或应当得知之日起算。(注意，必须是专利获得授权之日以后)
# 假冒专利的行政罚款，有违法所得的，处4倍以下(含4倍)罚款;没有违法所得的，处20W以下罚款
# 专利权人与他人订立的专利实施许可合同，应当自合同生效之日起3个月内向国务院专利行政部门备案
# PCT申请自优先权日起30个月内，办理进入国家阶段的手续，缴纳宽限费后可延长到32个月
# 提交生物材料保藏证明的期限是申请之日起4个月内，PCT是办理进入国家阶段手续之日起4个月内
# 管理专利工作的部门处理专利纠纷，收到请求书之日起5个工作日内立案并通知当事人；承办人员为单数，3人或以上；结案时间为立案之日起4个月，特别复杂的案情可延长1个月
# 查处假冒专利案件，应当自立案之日起1个月内结案，案情复杂的经批准可延长，但最多不超过15日
# 国务院专利行政部门发出授予专利权的通知后，申请人应当自收到通知书之日起2个月内办理登记手续
# 管理专利工作的部门处理时，认定侵权行为成立的，可以责令侵权人立即停止侵权行为，当事人不服的，可以自收到处理通知之日起15日内(依照《行政诉讼法》)向人民法院起诉；侵权人期满不起诉又不停止侵权行为的，管理专利工作的部门可以申请法院强制执行
# 专利权赔偿数额1W以上100W以下
# 专利权人与他人订立的专利实施许可合同，应当自合同生效之日起3个月内向国务院专利行政部门备案
# 发明或实用新型专利申请的优先权期限是12个月，外观设计的是6个月
# 当事人不服管理专利工作的部门的处理的，可以自收到处理通知书之日起15日内提起行政诉讼
#
# 涉及国家局的时间期限：
# 使用费的裁决的时间是3个月内
# 专利权评价报告的时间是2个月内
# 保密申请，预审是收到请求之日起4个月，终审是收到请求之日起6个月

# 申请日的更正，提交专利申请文件之日起2个月内或者申请人收到受理通知书之日起1个月内
# 权利丧失而请求恢复权利的，可以自收到通知之日起2个月内
# 办理授权登记手续的期限，收到通知之日起2个月
# 延长的期限不得超过2个月

# 专利申请号标准
# eg: 200490000001.3
# 第五位数字：1 表示发明专利申请
# 			  2 表示实用新型专利申请
# 			  3 表示外观设计专利申请
#             8 表示进入中国国家阶段的PCT发明专利申请
#			  9 表示进入中国国家阶段的PCT实用新型专利申请

# 专利文献种类标识代码标准
# A为 发明专利申请公布
# B为 发明专利授权公告
# C为 发明专利权部分无效宣告的公告
# U为 实用新型专利权授权公告
# Y为 实用新型专利权部分无效宣告的公告
# S为 外观设计专利授权公告或者专利权部分无效宣告的公告

# IPC (Internetional Patent Class) 国际专利分类表
# 五级分类：部 ，大类 ，小类 ，主组 ， 分组
# A部：人类生活必需（农，轻，医）
# B部: 作业、运输
# C部：化学、冶金
# D部：纺织、造纸 
# E部：固定建筑物（建筑，采矿）
# F部：机械工程
# G部： 物理
# H部： 电学

# 部 	(A-H)
# 大类	(A-H)XX      						注：XX为2位数字
# 小类  (A-H)XX(A-Z)						注：(A-Z)为任一大写字母
# 大组	(A-H)XX(A-Z)(1-3X)/00				注：(1-3X)为1到3位阿拉伯数字
# 小组  (A-H)XX(A-Z)(1-3X)/00(1-3X)/YY		注：YY为除00以外，至少任一2位数字

# PCT相关
# 提国际初步审查请求书期限:(a)向申请人传送国际检索报告之日起3个月届满之前；(b)自优先权日起22个月届满之前；以后到期的为准
