#开放式和封闭式全力要求
# 1、仅涉及组分时的新颖性判断
#  权利要求a:开放式 ，含有A+B
#  权利要求b:封闭式 ，由A+B组成
#  现有技术：A+B+C
#  结论： a没有新颖性 b有新颖性

# 新颖性（知识点：现有技术，抵触申请，惯用手段直接置换）--------最重要的原则，单独对比原则
				#三种主要情况，上下位概念，开放封闭，数值范围





# 单一性(从总的发明构思出发)
# 解决技术问题相同
# 技术上相关联
# 有相同或相应(相应:作用相同)的技术特征

# 答复无效 (针对性)
# 熟悉权利要求，引用关系，保护范围等
# 对证据简单分析（有效性，无效理由的合法性）
# 不清楚的问题一般是伴随着新颖性、创造性问题解决后，自然解决的
# 举证期一个月（例外情况：合并式修改后，补充的证据可以超过一个月）

# 答复审查意见通知书（全面性）

# 重要法条(四条可得90分,R53涵盖的) 
# A22(三性)
# A26(说明书，权利要求书)
# A31(单一性)
# R20.2(独权)

# 新颖性 -- 现有技术 -- 抵触申请 -- 惯用手段直接置换(考试几乎不要考虑，因为涉及具体技术)

# 创造性
# 三步法  1、与最接近的对比文件比.(研发的起点)
#		  2、相同的特征有没有被其他对比文件公开.			
#		  3、被公开的特征的作用要相同
#		  (两个相同，手段或技术方案或特征、作用，则没有创造性.公知常识的理由，实质与此相同)

# 实用性
# 先天不足(负面效果之类)
# 公开不充分,造成不清楚

# 单一性的判断
# 是否是总的发明构思出发(用于判断明显缺乏单一性的)
# 特定技术特征法是否相同或相应

# 创造性判断中技术启示的考量
# 1、当对比文件不存在与本案相同的改进需求
# 2、且技术手段在此对比文件中的作用与区别技术特征在本案中的作用不相同
# 3、本领域技术人员没有动机将区别技术手段应用于对比文件中，以解决发明实际解决的技术问题