#重点
#第四章>第六章>第二章>第三章
#次重点
#第一、五、三章
#不重点
#第七章第八章

# IPC分类表，文献种类编码等




# 专利受理程序--
#			-受理机关 	
#			-受理方式 （寄交、面交，电子邮件等）
#			-申请文件的准备 （哪些文件）
#			-申请文件的形式  （格式）
# 受理后--->受理通知书--
#						受理日  +  受理号


# ***** 现有技术的概念 / 不授权的主题 / 新颖性的判断 / 抵触申请的概念及相关 / 外观设计的条件
# ****  实用新型的保护客体 / 宽限期的情形 / 同样的发明创造申请 / 实用性的判断 / 创造性的判断 / 外观设计的保护客体

# 专利侵权行为，以生产经营为目的，未经许可，对发明、实用新型产品而言，包括5种：制造，使用，销售，许诺销售，进口
#											对外观设计专利产品而言，包括4种：制造，销售，许诺销售，进口

# 认定侵权的条件 七个条件同时满足
# A
# 1、被诉行为，属于专利权人有权禁止的法定行为
# 2、被诉行为发生时，专利权是有效的
# 3、被诉行为，是否以生产经营为目的
# 4、未经专利权人许可
# 5、被诉行为，在主观上有无过错?
# 6、法律上有豁免
# 7、被诉行为是否落入保护范围 ***
#
# B
# 1、必须有本地区、地域内的专利权
# 2、发生了法定的实施专利技术和？？的行为
# 3、发生的行为具有违法性
# 4、以生产经营为目的
# 5、未经专利权人许可
# 6、行为人主观上有过错（分为故意、非故意）
# 7、是否落入专利保护范围

# 应对侵权的救济途径
# 1、私了
# 2、起诉
# 3、请求地方知识产权局处理(有认定权，无判赔权)

# 应对权属纠纷的救济途径
# 1、私了
# 2、起诉
# 3、向管理专利工作的部门(地方知识产权局)请求调解

# 侵权种类
# 1 直接侵权，间接侵权（不考） 
# 2 相同侵权。等同侵权 （3+1原则：基本相同的手段+基本相同的功能+基本相同的效果+本领域技术人员无需创造性劳动可联想到的）

# 认定侵权后，(仅)承担民事责任
# 1、赔礼道歉
# 2、停止侵权行为
# 3、赔偿损失

# 非故意侵权包括 ： 使用、销售、许诺销售
# 可以免除赔偿责任，前提是：不知情 + 提供合法来源

# 规则的适用性
#		 		  发明     实用新型       外观设计
#推广应用	 		Y			N				N
#强制许可	 		Y			Y				N
#保密审查	 		Y			Y				N
#新颖性宽限期		Y			Y				Y
#PCT国际申请		Y			Y				N
#临时保护/遗传资源  Y			N				N
#本国优先权			Y			Y				N


# 判断实用性
#			  	无再现性
#				违背自然规律
#				利用独一无二的自然条件的产品
#				人体或动物体的非治疗目的的外科手术方法
#				测量人头或者动物体在极限情况下的生理参数的方法
#				无积极效果

# 判断新颖性
#			 现有技术
#					 时间界限
#							 申请日之前，包括优先权日。（不含当天）
#					 公开方式	
#							 出版物公开（各种印刷、打字的纸件，文献、论文、书籍等等）
#							 使用公开（制作、使用、销售、进口、交换等等）
#							 其他方式公开（主要是口头公开，报告、交谈、广播、电视电影等等）
#			 抵触申请
#			 对比文件
#			 审查基准
#					 相同内容的发明或者实用新型
#					 具体（下位）概念与一般（上位）概念
#					 惯用手段的直接置换(仅用于抵触申请)
#					 数值和数值范围
#					 包含性能、参数、用途或制备方法等特征的产品权利要求
#			 优先权
#					 外国优先权
#					 本国优先权
#			 宽限期

# 判断创造性
#			 现有技术（抵触申请不予考虑）
#					 突出的实质性特点（相对于现有技术是非显而易见的）
#									A、确定最接近的现有技术
#									B、确定发明的区别特征和发明实际解决的技术问题
#									C、判断要求保护的发明对本领域的技术人员来说是否显而易见
#
#					 显著的进步（有益的技术效果）
#									A、发明与现有技术相比具有更换的技术效果，克服不足、
#									B、为解决问题提供不同构思的技术方案
#									C、代表某种新的技术发展趋势
#									D、尽管某些方面有负面效果，但在其他方面具有明显积极的技术效果
#
#					 判断创造性时其他需考虑的其他因素
#									A、发明解决了人们一直渴望解决但始终未能获得成功的技术难题
#									B、发明克服了技术偏见
#									C、发明取得了预料不到的技术效果
#									D、发明在商业上获得成功（仅限于发明的技术特征直接导致的）

#			 所属技术领域的技术人员
#

# 单一性
#		总的发明构思
#		审查原则
#				技术特征
#				同类独立权利要求的单一性
#				不同类独立权利要求的单一性
#				从属权利要求的单一性

# 分案申请的申请日是母案的申请日(注意：非优先权日)


# 侵权赔偿额的确定
# 		A、依据专利权人受到的实际损失（只算直接损失）---需提供证据（账簿实践中难以）
#		B、以侵权获益计算	-----需提供证据（账簿实践中难以）
#		C、根据技术许可的合理倍数计算（一至三倍） -----需提供证据
#		   合理开支：维权成本（律师费，车马费等等）可以计算在内
#		D、法定赔偿额（兜底方案，一万以上，一百万以下）
# 判定公式		
# 			销售量减少数量 * 权利人的合理利润 	 （权利人的损失）
#			侵权产品销售数量 * 权利人的合理利润 （权利人的损失）		
#			侵权产品销售数量 * 侵权人合理利润 （侵权获益）

# 侵犯专利权的诉讼时效（得知或应当得知两年内）
# 行政处罚可以没收，查扣等，罚款可以处违法所得四倍以下（含四倍），没有违法所得的处20W以下。
# 违法所得计算公式，销售数量 * 销售价格 	

# 关于诉前禁令分三类
# 责令停止相关行为 --A66
# 财产保全
# 证据保全--A67					

# 产品制造方法的保护延及到可以限制用该方法直接获得的产品，包括制造、销售、许诺销售、进口
# 举证责任倒置，适用于新方法，新产品，才可转置

# 要求支付临时使用费的，必须是技术方案同事落入公开文本(公布时)和授权文本(授权时)的保护范围之内。

# 无效宣告中三种允许的修改方式
# a 删除权利要求
# b 删除技术方案
# c 合并权利要求

# 专利分类
# 从申请的角度，发明专利、实用新型专利、外观设计专利
# 从授权后保护的角度，产品专利(发明专利或实用新型)、方法专利(只能是发明专利)、外观设计专利
# 普通专利、国防专利、保密专利

# 专利先申请制(是针对不同申请人的，不适应同一人)
 
# 专利审查制度
# 发明--->初审--->公布--->实审--->公告
# 实用新型/外观设计--->初审--->公告

# 专利救济制度
# 复审、无效、权利恢复、行政复议、司法终审

# 申请流程
# 发明专利-->初审-->合格-->国家公布(不早于18个月)-->提出实审请求-->合格则授权-->国家公告(-->任何人可向复审委提无效申请-->不服可提行政诉讼)	
#				 -->驳回						 -->可撤回		-->驳回-->向复审委提出复审请求(-->不服可提行政诉讼)
#
# 实用新型/外观设计--->初审--->合格则授权
#		  		   		   --->驳回
#
# 以上流程中，贯穿着其他程序：权利恢复程序，中止程序，行政复议程序
# 其他程序，保密申请无国家公布；涉及国防的由国防局审查，国家局授权；PCT申请

# 专利审查程序包括：初审、实审、复审；
# 确权程序：无效程序

# 授权条件：形式条件 + 实质条件
# 发明专利审查时都审
# 实用新型/外观审查时，主要审形式条件。实质条件在无效程序中才有用

# 专利权的保护
# 铁路警察各管一段：国家局(不直接处理案件，有审查权、授权的权力)、地方局(只受理)、国防局(不授权，只审查)
# 县级以上管理部门才有执法权，部分中级法院才有初审管辖权
# 行政体系保护包括，专利审查，专利管理，行政执法，海关执法保护
# 司法保护，相关案件诉讼


# 专利权
# 包括基本权利和附属权利
# 基本权利，实质是排他权.派生的两个权利：先占权(一种抗辩权)，临时保护权
# 附属权包括：转让权(A10)，许可权(A12)，标注权(A17.2)，放弃权(A44)，质押权(R14.3)(注意：不是抵押)

# 专利权的法律特征
# 专有性、地域性、时间性

# 专利权期限
# 实际申请日(PCT是国际申请日，均不包括优先权日)起，发明专利20年，实用新型/外观设计10年
# 实际获得专利权利，从授权公告日起算

# 临时保护从公布之后才可去要适当的费用，只适用于发明，不适用实用新型/外观设计

# 推广应用
# 适用条件：国有企事业单位 + 发明专利 + 重大意义的事项
# 申请资格：国务院有关主管部门、省市直辖市的人民政府
# 审批：国务院批准
# 普通许可 + 支付使用费

# 强制许可 请求审批制 33321
# 三种类型：为商业目的、为公共利益、从属专利目的
# 三个限制：半导体领域、主要为国内市场、满足合理条件
# 三种请求人(非专利权人)：单位/个人、部门、国务院
# 两类专利: 发明专利；实用新型
# 一个审批机关：国家局
# 请求终止：须是专利权人
#
# 商业目的：--未充分实施：授权日起满3年 / 申请日起满4年 + 以后到期的为准 + (无正当理由) + 未实施或未充分实施
# 			--垄断行为
# 许可费的多少是单列请求的


# 必须国家局做决定，不能直接起诉的情形：
# 被驳回
# 授权不当，无效程序
# 强制许可费没有达成协议的

# 费用
# 七大类十九种
# 可减缓的费用四种：申请费(不包括附加费和公布印刷费)、实审费、复审费、授予专利权当年起三年的年费

# 优先权 ?
# 港澳(台)以外的外国优先权、港澳(台)优先权、PCT优先权，本国优先权

# 初审
# 审四件事：费用、申请文件的形式审查、与申请文件伴随的法律手续、明显的实质性缺陷A5,A25

# 主动修改时机
# 发明：提出实审请求时
#       收到进入实审阶段通知书起3个月内
# 实用新型/外观设计：申请日起2个月
# PCT：进入之日起2个月


# 无效条款
# A2        定义
#               发明，是指对产品、方法或者其改进所提出的新的技术方案
#               实用新型，是指对产品的形状、构造或者其结合所提出的适于实用的新的技术方案
#               外观设计，是指对产品的形状、图案或者其结合以及色彩与形状、图案的结合所作出的富有美感并适于工业应用的新设计                
# A20.1        保密审查
# A22       三性
# A23       现有设计
# A26.3     （不清楚）说明书应当对发明或者实用新型作出清楚、完整的说明，以所属技术领域的技术人员能够实现为准
# A26.4     （不支持）权利要求书应当以说明书为依据，清楚、简要地限定要求专利保护的范围
# A27.2     （不清楚）申请人提交的有关图片或者照片应当清楚地显示要求专利保护的产品的外观设计
# A33       修改超范围
# R20.2     独权完整
# R43.1     优先权
# A5        违法、遗传资源 
# A25       
#           科学发现 
#           智力活动的规则和方法
#           疾病的诊断和治疗方法
#           动物和植物品种
#           用原子核变换方法获得的物质
#           对平面印刷品的图案、色彩或者二者的结合作出的主要起标识作用的设计。对前款第(四)项所列产品的生产方法，可以依照本法规定授予专利权
# A9        重复授权

















